Revit 2024 API
IFCLegacyStairOrRamp.RiserHeight Property
 The height of riser.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double RiserHeight { get; }
Visual Basic
Public ReadOnly Property RiserHeight As Double
	Get
Visual C++
public:
property double RiserHeight {
	double get ();
}
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace